cmsis-svd/cmsis-svd/data/HDSC/HC32L150JX.svd
                <register>
                    <name>DBWDT_CTRL</name>
                    <description>desc DBWDT_CTRL</description>
                    <addressOffset>0x54</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xA0</resetMask>
                    <fields>
                        <field>
                            <name>SWWDG_BRK</name>
                            <description>desc SWWDG_BRK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HWWDG_BRK</name>
                            <description>desc HWWDG_BRK</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_CTRL</name>
                    <description>desc INT_CTRL</description>
                    <addressOffset>0x60</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3B</resetMask>
                    <fields>
                        <field>
                            <name>MAINEN</name>
                            <description>desc MAINEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUBEN</name>
                            <description>desc SUBEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCSVIE</name>
                            <description>desc MCSVIE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCSVIE</name>
                            <description>desc SCSVIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCSEN</name>
                            <description>desc FCSEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_PEND</name>
                    <description>desc INT_PEND</description>
                    <addressOffset>0x64</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3B</resetMask>
                    <fields>
                        <field>
                            <name>MAIN</name>
                            <description>desc MAIN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SUB</name>
                            <description>desc SUB</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MCSVI</name>
                            <description>desc MCSVI</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCSVI</name>
                            <description>desc SCSVI</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FCS</name>
                            <description>desc FCS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_CLR</name>
                    <description>desc INT_CLR</description>
                    <addressOffset>0x68</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3B</resetMask>
                    <fields>
                        <field>
                            <name>MAIN</name>
                            <description>desc MAIN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SUB</name>
                            <description>desc SUB</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MCSVC</name>
                            <description>desc MCSVC</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCSVC</name>
                            <description>desc SCSVC</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>FCS</name>
                            <description>desc FCS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
