cmsis-svd/cmsis-svd/data/HDSC/HC32L150JX.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="CT0_PWM">
            <name>CT1_PWM</name>
            <description>desc CT_PWM</description>
            <baseAddress>0x40025040</baseAddress>
            <alternatePeripheral>CT1_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_PWM">
            <name>CT2_PWM</name>
            <description>desc CT_PWM</description>
            <baseAddress>0x40025080</baseAddress>
            <alternatePeripheral>CT2_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_PWM">
            <name>CT3_PWM</name>
            <description>desc CT_PWM</description>
            <baseAddress>0x400250C0</baseAddress>
            <alternatePeripheral>CT3_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_PWM">
            <name>CT4_PWM</name>
            <description>desc CT_PWM</description>
            <baseAddress>0x40025200</baseAddress>
            <alternatePeripheral>CT4_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_PWM">
            <name>CT5_PWM</name>
            <description>desc CT_PWM</description>
            <baseAddress>0x40025240</baseAddress>
            <alternatePeripheral>CT5_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_PWM">
            <name>CT6_PWM</name>
            <description>desc CT_PWM</description>
            <baseAddress>0x40025280</baseAddress>
            <alternatePeripheral>CT6_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CT0_PWM">
            <name>CT7_PWM</name>
            <description>desc CT_PWM</description>
            <baseAddress>0x400252C0</baseAddress>
            <alternatePeripheral>CT7_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>CT0_RT</name>
            <description>desc CT_RT</description>
            <baseAddress>0x40025000</baseAddress>
            <alternatePeripheral>CT0_PPG</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CSR</name>
                    <description>desc CSR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>TCNT</name>
                    <description>desc TCNT</description>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>TCR</name>
                    <description>desc TCR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x73FF</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>desc START</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENCNT</name>
                            <description>desc ENCNT</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODS</name>
                            <description>desc MODS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLRT</name>
                            <description>desc PLRT</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FUNC</name>
                            <description>desc FUNC</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>T32</name>
                            <description>desc T32</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDGS</name>
                            <description>desc EDGS</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKS</name>
                            <description>desc CLKS</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STA</name>
                    <description>desc STA</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x55</resetMask>
                    <fields>
                        <field>
                            <name>UDFIR</name>
                            <description>desc UDFIR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGIR</name>
                            <description>desc TRGIR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDFIE</name>
                            <description>desc UDFIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGIE</name>
                            <description>desc TRGIE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TCR2</name>
                    <description>desc TCR2</description>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x81</resetMask>
                    <fields>
                        <field>
                            <name>CLKS3</name>
                            <description>desc CLKS3</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GTIE</name>
                            <description>desc GTIE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
